# Инициализация списков
my_list = ["leaf", "cherry", "fish"]
my_list1 = ["D", "C", "B", "A"]
my_list2 = [3, 4, 5, 1, 2]

# Сортировка списка my_list по возрастанию
my_list.sort()
# Результат: ['cherry', 'fish', 'leaf']

# Сортировка списка my_list1 по возрастанию
my_list1.sort()
# Результат: ['A', 'B', 'C', 'D']

# Сортировка списка my_list2 по возрастанию
my_list2.sort()
# Результат: [1, 2, 3, 4, 5]

# Вывод отсортированных копий списков
print(sorted(my_list))  # Возвращает отсортированную копию списка my_list без изменения исходного.
# Результат: ['cherry', 'fish', 'leaf']

print(sorted(my_list1))  # Возвращает отсортированную копию списка my_list1 без изменения исходного.
# Результат: ['A', 'B', 'C', 'D']

print(sorted(my_list2))  # Возвращает отсортированную копию списка my_list2 без изменения исходного.
# Результат: [1, 2, 3, 4, 5]
